IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28004x_erad_hwbp_regs.xml
<module id="ERAD_HWBP_REGS" HW_revision="" description="ERAD HWBP Registers">
	<register id="HWBP_MASK" width="32" page="1" offset="0x0" internal="0" description="HWBP Mask Register">
		<bitfield id="MASK" description="Address mask register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HWBP_REF" width="32" page="1" offset="0x2" internal="0" description="HWBP Reference Register">
		<bitfield id="REF" description="Address reference register" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="HWBP_CLEAR" width="16" page="1" offset="0x4" internal="0" description="HWBP Clear Register">
		<bitfield id="EVENT_CLR" description="Event Clear register" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="HWBP_CNTL" width="16" page="1" offset="0x6" internal="0" description="HWBP Control Register">
		<bitfield id="BUS_SEL" description="Bus select bits" begin="4" end="2" width="3" rwaccess="RW"/>
		<bitfield id="STOP" description="Stop bit (Halt/No Halt of CPU)" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RTOSINT" description="RTOSINT bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="COMP_MODE" description="Compare mode" begin="9" end="7" width="3" rwaccess="RW"/>
	</register>
	<register id="HWBP_STATUS" width="16" page="1" offset="0x7" internal="0" description="HWBP Status Register">
		<bitfield id="EVENT_FIRED" description="HWBP Event Fired bits" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="MODULE_ID" description="Identification bits" begin="13" end="8" width="6" rwaccess="R"/>
		<bitfield id="STATUS" description="Status bits" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
</module>
